_posts/2016-04-29-Enough-with-the-hyperbole---hy-does-things-that-are-not-as-easy-in-Python.html
---
title: Enough with the hyperbole - hy does things that are not as easy in Python
date: 2016/04/29 14:45:54
updated: 2016/04/29 14:45:54
categories: hylang,python
tags: 
---



<p>
We run a lot of molecular simulations using Python. Here is a typical script we would use. It creates an instance of a calculator inside a context manager.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #0000FF;">from</span> ase <span style="color: #0000FF;">import</span> Atoms, Atom
<span style="color: #0000FF;">from</span> jasp <span style="color: #0000FF;">import</span> *

<span style="color: #BA36A5;">co</span> = Atoms([Atom(<span style="color: #008000;">'C'</span>,[0,   0, 0]),
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   Atom(<span style="color: #008000;">'O'</span>,[1.2, 0, 0])],
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   cell=(6., 6., 6.))

<span style="color: #0000FF;">with</span> jasp(<span style="color: #008000;">'molecules/simple-co'</span>, <span style="color: #8D8D84;">#</span><span style="color: #8D8D84; font-style: italic;">output dir</span>
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span> xc=<span style="color: #008000;">'PBE'</span>,  <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">the exchange-correlation functional</span>
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span> nbands=6,  <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">number of bands</span>
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span> encut=350, <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">planewave cutoff</span>
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span> ismear=1,  <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Methfessel-Paxton smearing</span>
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span> sigma=0.01,<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">very small smearing factor for a molecule</span>
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span> atoms=co) <span style="color: #0000FF;">as</span> calc:
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">print</span> <span style="color: #008000;">'energy = {0} eV'</span>.<span style="color: #006FE0;">format</span>(co.get_potential_energy())
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">print</span> co.get_forces()
</pre>
</div>

<p>
This basic approach has served us for more than a decade! Still, there are things about it that bug me. Most significantly is the arbitrary keyword args. We keep a list of legitimate kwargs in the module, but there is no documentation or validation to go with them that is accessible to users (short of reading the code). There are well over 100 kwargs that are possible, so documenting them in the <span class="underline"><span class="underline">init</span></span> docstring is not that useful (we did it once, see <a href="https://gitlab.com/ase/ase/blob/master/ase/calculators/jacapo/jacapo.py#L143">https://gitlab.com/ase/ase/blob/master/ase/calculators/jacapo/jacapo.py#L143</a> , and it made a really long docstring). Providing validation for these (some can only be integers, floats, specific strings, lists, or dictionaries) is not easy. I did this for another simulation code by providing <a href="https://gitlab.com/ase/ase/blob/master/ase/calculators/jacapo/validate.py">validation functions</a> that could be looked up dynamically by name. I never did come up with a way to provide kwarg specific documentation though.
</p>

<p>
The access to documentation while writing code is becoming increasingly important to me; I don't remember all the kwargs and what values are valid. More importantly, as I teach people how to use these tools, it is not practical to tell them to "read the code". I don't even want to do that while running simulations, I just want to setup the simulation and run it.
</p>

<p>
Today, I had an idea that a macro in hy would allow me to get documentation and validation of these kwargs.
</p>

<p>
The pseudocode would look like this. Each "kwarg" will actually be a function that has a docstring, performs validation, and evaluates to its argument. "vaspm" is a macro that will expand to the calculator with the desired kwargs. We will have to be careful that these function names don't conflict with other function names, but that could be addressed in a variety of ways with namespaces and function names.
</p>

<div class="org-src-container">

<pre class="src src-hy"><span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">pseudocode of the macro</span>
(<span style="color: #006FE0;">setv</span> calc (vaspm <span style="color: #008000;">"molecules/simple-co"</span>
                  (xc <span style="color: #008000;">"PBE"</span>)
                  (nbands 6)
                  (encut 350)
                  (ismear 1)
                  (sigma 0.01)
                  (atoms co)))
</pre>
</div>

<p>
This would expand to the following block, which is equivalent to what we already do today. In the process of expansion though, we gain docstrings and validation!
</p>

<div class="org-src-container">

<pre class="src src-hy">(<span style="color: #006FE0;">setv</span> calc (Vasp <span style="color: #008000;">"molecules/simple-co"</span>
                 <span style="color: #D0372D;">:xc</span> <span style="color: #008000;">"PBE"</span>
                 <span style="color: #D0372D;">:nbands</span> 6
                 <span style="color: #D0372D;">:encut</span> 6
                 <span style="color: #D0372D;">:ismear</span> 1
                 <span style="color: #D0372D;">:sigma</span> 0.01
                 <span style="color: #D0372D;">:atoms</span> co))
</pre>
</div>

<p>
Here is a toy implementation that illustrates what the functions are, and how we build up the code from the macro.
</p>

<div class="org-src-container">

<pre class="src src-hy">(<span style="color: #0000FF;">defn</span> <span style="color: #006699;">encut</span> [cutoff]
  <span style="color: #008000;">"The planewave cutoff energy in eV."</span>
  (<span style="color: #0000FF;">assert</span> (<span style="color: #006FE0;">integer?</span> cutoff))
  (<span style="color: #0000FF;">assert</span> (<span style="color: #006FE0;">&gt;</span> cutoff 0))
  (<span style="color: #006FE0;">print</span> <span style="color: #008000;">"encut validated"</span>)
  cutoff)

(<span style="color: #0000FF;">defn</span> <span style="color: #006699;">xc</span> [exc]
  <span style="color: #008000;">"The exchange correlation functional. Should be a string of PBE or LDA."</span>
  (<span style="color: #0000FF;">assert</span> (<span style="color: #006FE0;">string?</span> exc))
  (<span style="color: #0000FF;">assert</span> (<span style="color: #006FE0;">in</span> exc [<span style="color: #008000;">"PBE"</span> <span style="color: #008000;">"LDA"</span>]))
  (<span style="color: #006FE0;">print</span> <span style="color: #008000;">"exc validated"</span>)
  exc)


(<span style="color: #0000FF;">defclass</span> <span style="color: #6434A3;">Calculator</span> []
  <span style="color: #008000;">"Toy class representing a calculator."</span>
  (<span style="color: #0000FF;">defn</span> <span style="color: #006699;">__init__</span> [self wd <span style="color: #6434A3;">&amp;kwargs</span> kwargs]
    (setattr self <span style="color: #008000;">"wd"</span> wd)
    (<span style="color: #0000FF;">for</span> [key kwargs]
      (setattr self key (<span style="color: #006FE0;">get</span> kwargs key)))))
</pre>
</div>

<p>
We tangle that block to calculator.hy so we can reuse it. First we show the traditional syntax.
</p>

<div class="org-src-container">

<pre class="src src-hy">(<span style="color: #0000FF;">import</span> <span style="color: #006699;">[calculator [*]]</span>)

(<span style="color: #006FE0;">setv</span> calc (Calculator <span style="color: #008000;">"some-dir"</span> <span style="color: #D0372D;">:encut</span> 400 <span style="color: #D0372D;">:xc</span> <span style="color: #008000;">"PBE"</span>))

(<span style="color: #006FE0;">print</span> calc.wd)
(<span style="color: #006FE0;">print</span> calc.encut)
(<span style="color: #006FE0;">print</span> calc.xc)
</pre>
</div>
<pre class="example">
some-dir
400
PBE
</pre>

<p>
Note, we can also do this, and get the validation too. It is verbose for my taste, but shows what we need the final code to look like, and incidentally how this would be done in Python too. We just need a macro that expands to this code.
</p>

<div class="org-src-container">

<pre class="src src-hy">(<span style="color: #0000FF;">import</span> <span style="color: #006699;">[calculator [*]]</span>)

(<span style="color: #006FE0;">setv</span> calc (Calculator <span style="color: #008000;">"some-dir"</span> <span style="color: #D0372D;">:encut</span> (encut 400) <span style="color: #D0372D;">:xc</span> (xc <span style="color: #008000;">"PBE"</span>)))

(<span style="color: #006FE0;">print</span> calc.wd)
(<span style="color: #006FE0;">print</span> calc.encut)
(<span style="color: #006FE0;">print</span> calc.xc)
</pre>
</div>

<pre class="example">
encut validated
exc validated
some-dir
400
PBE
</pre>

<p>
That is what this macro below does. We build up that code by making a keyword of the function name, and setting it to the value of the form the function is in.
</p>

<div class="org-src-container">

<pre class="src src-hy">(<span style="color: #0000FF;">defmacro</span> <span style="color: #006699;">vaspm</span> [wd <span style="color: #6434A3;">&amp;rest</span> body]
  <span style="color: #036A07;">"Macro to build a Calculator with validation of arguments in BODY"</span>
  (<span style="color: #0000FF;">let</span> [code `(Calculator ~wd)]
    (<span style="color: #0000FF;">for</span> [form body]
      (.append code (<span style="color: #006FE0;">keyword</span> (<span style="color: #006FE0;">name</span> (<span style="color: #006FE0;">car</span> form))))
      (.append code form))
    code))
</pre>
</div>

<p>
Now, lets consider the macro version.
</p>

<div class="org-src-container">

<pre class="src src-hy">(<span style="color: #0000FF;">import</span> <span style="color: #006699;">[calculator [*]]</span>)
(<span style="color: #0000FF;">require</span> <span style="color: #006699;">calculator</span>)

(<span style="color: #006FE0;">setv</span> calc (vaspm <span style="color: #008000;">"some-dir"</span> (encut 400) (xc <span style="color: #008000;">"PBE"</span>)))
(<span style="color: #006FE0;">print</span> calc.wd)
(<span style="color: #006FE0;">print</span> calc.encut)
(<span style="color: #006FE0;">print</span> calc.xc)

<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">proof we can get to the encut docstring!</span>
(help encut)
</pre>
</div>

<pre class="example">
encut validated
exc validated
some-dir
400
PBE
Help on function encut in module calculator:

encut(cutoff)
    The planewave cutoff energy in eV.
</pre>

<p>
Sweet. The macro allows us to simplify our notation to be approximately the same as the original function, but with validation and docstring availability. Here is a variation of the macro that even uses keywords and builds the validation in from the keyword. It is not clear we can access the docstrings so easily here (ok, we can build an eldoc function that works either way, but the function method above is "more native").
</p>

<div class="org-src-container">

<pre class="src src-hy">(<span style="color: #0000FF;">import</span> <span style="color: #006699;">[calculator [*]]</span>)
(<span style="color: #0000FF;">require</span> <span style="color: #006699;">calculator</span>)


(<span style="color: #0000FF;">defmacro</span> <span style="color: #006699;">vasp2</span> [wd <span style="color: #6434A3;">&amp;rest</span> kwargs]
  (<span style="color: #0000FF;">let</span> [code `(Calculator ~wd)]
    (<span style="color: #0000FF;">for</span> [x (<span style="color: #006FE0;">range</span>   0 (len kwargs) 2)]
      (<span style="color: #0000FF;">let</span> [kw (<span style="color: #006FE0;">nth</span> kwargs x)
            val (<span style="color: #006FE0;">nth</span> kwargs (<span style="color: #006FE0;">+</span> 1 x))]
        (.append code kw)
        (.append code `(~(HySymbol (<span style="color: #006FE0;">name</span> kw)) ~val))))
    code))

(<span style="color: #006FE0;">print</span> (<span style="color: #006FE0;">macroexpand</span> '(vasp2 <span style="color: #008000;">"/tmp"</span> <span style="color: #D0372D;">:encut</span> 1 <span style="color: #D0372D;">:xc</span> <span style="color: #008000;">"PBE"</span>)))

(<span style="color: #006FE0;">setv</span> calc (vasp2 <span style="color: #008000;">"some-dir"</span>
                  <span style="color: #D0372D;">:encut</span> 400
                  <span style="color: #D0372D;">:xc</span> <span style="color: #008000;">"PBE"</span>))
(<span style="color: #006FE0;">print</span> calc.wd)
(<span style="color: #006FE0;">print</span> calc.encut)
(<span style="color: #006FE0;">print</span> calc.xc)
</pre>
</div>
<pre class="example">
(u'Calculator' u'/tmp' u'\ufdd0:encut' (u'encut' 1L) u'\ufdd0:xc' (u'xc' u'PBE'))
encut validated
exc validated
some-dir
400
PBE
</pre>

<p>
To summarize here, we have looked at some ways to incorporate validation and documentation into kwargs. There are certainly ways to do this in Python, using these auxiliary functions. In fact we use them in hy too. We could build the validation into a Python <span class="underline"><span class="underline">init</span></span> function too, using dynamic lookup of the function names, and evaluation of the functions. The macro features of hy give different opportunities for this, and different syntactical sugars to work with. The hy approach leads to less duplication (e.g. only a keyword, not a keyword and a function name that are the same), which will lead to fewer mistakes of the type xc=xd(something). Overall, interesting differences to contemplate.
</p>

<p>
From a developer point of view there is the burden of writing all the validation functions, but the payoff is access to documentation and optionally, validation. Also, no kwargs that are not allowed will work. Right now, with **kwargs, they might silently fail.
</p>
<p>Copyright (C) 2016 by John Kitchin. See the <a href="/copying.html">License</a> for information about copying.<p>
<p><a href="/org/2016/04/29/Enough-with-the-hyperbole---hy-does-things-that-are-not-as-easy-in-Python.org">org-mode source</a></p>
<p>Org-mode version = 8.2.10</p>